tests/load/testplans/LoadTest01.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Nutrisolutions APIs Performance ">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="NutriSolutions API Performance ">
        <stringProp name="TestPlan.comments">NutriSolutions API testing with 200 concurent users </stringProp>
        <intProp name="ThreadGroup.num_threads">200</intProp>
        <intProp name="ThreadGroup.ramp_time">20</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">2</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Nutrisolutions Environment Variables">
          <collectionProp name="Arguments.arguments">
            <elementProp name="BASE_URL" elementType="Argument">
              <stringProp name="Argument.name">BASE_URL</stringProp>
              <stringProp name="Argument.value">apiqa.digitalag.farm</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="AUTH_TOKEN" elementType="Argument">
              <stringProp name="Argument.name">AUTH_TOKEN</stringProp>
              <stringProp name="Argument.value">Bearer eyJhbGciOiJSUzI1NiIsImtpZCI6Ii0tUGExaWh6UWtQalBJTWYzajRUZnFIcUVUY19SUzI1NiJ9.eyJzdWIiOiJ0ZXN0bXAwNEBnbWFpbC5jb20iLCJhdWQiOiJyc19jbGllbnRfbnMiLCJqdGkiOiJ5UXRRb2tmRVdTN1lINWRqejJoR09qIiwiaXNzIjoiaHR0cHM6Ly9zc29xYS5sYW5kb2xha2VzaW5jLmNvbSIsImlhdCI6MTc4ODg1MDY5NCwiZXhwIjoxNzg4ODUyNDk0LCJyb2xlIjoiR0dfUmVzdHJpY3RlZF9OU19XT0FfUUEiLCJuYW1lIjoidGVzdG1wMDQiLCJnaXZlbl9uYW1lIjoiTVBPTCIsImZhbWlseV9uYW1lIjoiQ29udHJhY3RvciJ9.BAcN_7sEm37NvhBrgRtznoKaxU55QxAg9_C8WbdAKMZF2E64T6G8dAmB5mEDZ4uVoi3FG03g4zVd7EQ5BIJmKP6NedP2XshTM9PnuHVxyKbjR9wUsjH3guFAQJWQjQht1d--mMfQPFTF9I-_eHzef33Lg1hmVdPgFMGXZauLqzlSIP1B0wJC_IFnnThjMNIEZuAedZ12nXpYxe3qK_QlMv52sVDOCiNJvB_Dxa5GkD2ZRaxW2y_JF1EbBmrWlz5QBZ8ikrUWjKafI8A7Q3GpxICMU4OWvPkS3hkIY7aaZfgLrwf6fIq9s79si0oLz5QVdE3TCwGmCVa4d-7y0ZZ1HJs1X_8lQrJgouNy2uJckTPpnAWe8QOnrIhmPTFucrmngrSmVSTRQJ5KV9RFntUCYs4nj1n1zMrH0NKkx578QgAyNH8D3rTqSKimLFnNmec84N97-Pzv0wG-lc8nlc76E0OD6WcCdJdiQwiDFF1zBfXmUuZfeXkAZMLqzn2YdlAu9tw34UwW9ati-kNf0-udK1OHd8FVK1hFJEXUqk8uxGXhcrJ9JYBSguVfLHFUyfY0nLvNdL6mcnbzP7tNrtvxd_kKboZ3SJq3Ss8p6_kAHHNjqsCVkUcB0DSmUos8GXW61kZBglxGxZbYp_7EQf1AGadxDpc4wXwSJuhmWOM5S_8</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Nutrisolutions APIs Request Headers">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">x-api-key</stringProp>
              <stringProp name="Header.value">smlmaug5cnzqg26iwxnmrg7g1plmxd63</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">${AUTH_TOKEN}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Validate Performance of &quot;GET Login Details&quot; API">
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/nsapi/v1/Login/Authenticate</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Validate Retrieval of Work Order Count via GET API">
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/nsapi/v1/workorders/GetWorkOrderCount?year=2026</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">C:\Users\sanjay.kumar\LocalBin_sanjay.kumar\Playwright\LoadTesting\SummaryReport\Testresult1s.csv</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="AssertionVisualizer" testclass="ResultCollector" testname="Assertion Results">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>